Repository: Amir-4m/insta-follow
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fa

source: created time
fa: زمان ایجاد شده

source: updated time
fa: زمان به روز شده

source: username
fa: نام کاربری

source: name
fa: نام

source: value
fa: مقدار

source: value data type
fa: جنس مقدار

source: error occurred while logging in!
fa: خطا در ورود کاربر رخ داده!

source: invalid credentials provided!
fa: اطلاعات نادرست می باشد!

source: shortcode field is required for like and comment !
fa: فیلد shortcode برای لایک و کامنت اجباری می باشد

source: instagram_username field is required for follow!
fa: فیلد نام کاربری اینستاگرام برای فالو اجباری می باشد

source: inappropriate word has been found in the text!
fa: کلمه نامناسب در متن یافت شد!

source: You do not have enough coin to create order
fa: سکه شمابرای ثبت سفارش کافی نیست

source: order created
fa: سفارش ساخته شد

source: id is not valid!
fa: آی دی معتبر نمی باشد!

source: purchase_token is required for gateway bazaar!
fa: توکن خرید برای درگاه بازار احباری می باشد!

source: Transfer amount is invalid!
fa: مقدار ورودی برای انتقال نامعتبر می باشد.

source: Target page does not exists
fa: کاربری با این صفحه وجود ندارد

source: Transfer amount is higher than your coin balance!
fa: مقدار سکه ورودی برای انتقال بیشتر از سکه موجود شما می باشد.

source: transfer to page %s
fa: انتقال سکه به صفحه %s

source: transfer from page %s
fa: انتقال سکه از صفحه %s

source: order does not exists!
fa: سفارش موجود نمی باشد!

source: make sure the limit value is a positive number!
fa: لطفا از مثبت بودن عدد برای محدود کردن اطمینان حاصل کنید

source: order with this id does not exist !
fa: سفارشی با این آی دی موجود نمی باشد!

source: order with this id already has been done by this page !
fa: سفارش با این آی دی قبلا توسط این صفحه انجام شده است!

source: error in verifying purchase
fa: خطا در تایید پرداخت

source: coin package has been purchased.
fa: بسته سکه خریداری شده است.

source: error in submitting order gateway
fa: خطا در ثبت درگاه

source: error in getting order gateway
fa: خطا در دریافت درگاه برای سفارش

source: version must be set in query params!
fa: شماره نسخه باید در پارامتر کوئری ایجاد شود!

source: no allowed gateway found!
fa: هیچ درگاهی یافت نشد!

source: error in getting gateway
fa: خطا در دریافت درگاه

source: daily reward
fa: هدیه روزانه

source: Invalid payload.
fa: ورودی نامعتبر!

source: Invalid signature.
fa: توکن احراز هویت نامعتبر می باشد.

source: password
fa: کلمه عبور

source: login attempt
fa: تلاش برای ورود

source: is enable
fa: فعال است

source: Instagram Account
fa: حساب اینستاگرام

source: Instagram Accounts
fa: حساب های اینستاگرام

source: Like
fa: لایک

source: Follow
fa: فالو

source: Comment
fa: کامنت

source: action type
fa: نوع عمل

source: action value
fa: ارزش انجام

source: buying value
fa: ارزش خرید

source: Insta Action
fa: اکشن اینستاگرام

source: Insta Actions
fa: اکشن ها اینستاگرام

source: action value must be lower than buy value
fa: ارزش انجام باید از ارزش خرید کمتر باشد.

source: instagram username
fa: نام کاربری اینستاگرام

source: instagram id
fa: شناسه اینستاگرام

source: Insta Page
fa: صفحه اینستاگرامی

source: Insta Pages
fa: صفحات اینستاگرامی

source: device id
fa: شناسه دستگاه

source: Device
fa: دستگاه

source: Devices
fa: دستگاه ها

source: comment text
fa: متن کامنت

source: Comments
fa: کامنت ها

source: target number
fa: مقدار هدف

source: link
fa: لینک

source: media properties
fa: جزئیات مدیا

source: entity ID
fa: شناسه موجودیت

source: description
fa: توضیحات

source: order enabled properly.
fa: سفارش فعال شد.

source: Order
fa: سفارش

source: Orders
fa: سفارشات

source: Comment is not allowed in like and follow method!
fa: کامنت در فالو و لایک جایز نمی باشد!

source: Validated
fa: تایید شده

source: Rejected
fa: رد شده

source: status
fa: وضعیت

source: validated time
fa: تاریخ تایید

source: User Inquiry
fa: وظایف کاربر

source: User Inquiries
fa: وظایف کاربر

source: amount
fa: مقدار

source: amount offer
fa: پیشنهاد در مقدار

source: price
fa: قیمت

source: price offer
fa: پیشنهاد در قیمت

source: package title
fa: نام بسته

source: package sku
fa: شناسه بسته

source: Coin Package
fa: بسته سکه

source: Coin Packages
fa: بسته های سکه

source: You could not set both price offer and amount offer!
fa: پیشنهاد همزمان برای قیمت و مقدار غیر مجاز است!

source: Amount offer should not be lower than real amount!
fa: ورودی پیشنهاد برای مقدار باید کمتر از مقدار واقعی باشد!

source: Price offer should not be higher than real price!
fa: ورودی پیشنهاد برای قیمت باید کمتر از قیمت واقعی باشد!

source: transaction id
fa: شناسه تراکنش

source: is paid
fa: وضعیت پرداخت

source: version name
fa: نام نسخه

source: redirect url
fa: آدرس بازگشتی

source: Coin Package Order
fa: سفارش مالی

source: Coin Package Orders
fa: سفارشات مالی

source: Coin Transaction
fa: تراکنش

source: Coin Transactions
fa: تراکنش ها

source: Open
fa: باز

source: Approved
fa: تایید شده

source: report text
fa: متن گزارش

source: Report Abuse
fa: گزارش تخلف

source: Report Abuses
fa: گزارشات تخلف

source: pattern
fa: الگو

source: Block Word Regex
fa: الگوی بلاک کلمه

source: blocked text
fa: متن های بلاک شده

source: Blocked Text
fa: متن بلاک شده

source: Blocked Texts
fa: متن های بلاک شده

source: version_name
fa: نام نسخه

source: code
fa: کد

source: Allowed Gateway
fa: درگاه مجاز

source: Allowed Gateways
fa: درگاه های مجاز

source: penalty
fa: جریمه

source: order completed
fa: سفارش تکمیل شد
