START_USER_HAS_PAGE = "سلام {} عزیز خوش آمدی."
START_USER_HAS_NO_PAGE = """
سلام {} عزیز خوش آمدی.
متاسفانه تا کنون صفحه اینستاگرامی برای شما ثبت نشده است.
لطفا برای ثبت صفحه اینستاگرام خود آی دی صفحه خود را
به صورت username@ بنویسید و ارسال کنید.
"""

CHOICE_PROFILE = "مشاهده پروفایل"
CHOICE_ADD_PAGE = "اضافه کردن صفحه اینستاگرام جدید"
CHOICE_DELETE_PAGE = "حذف صفحه اینستاگرام"
CHOICE_CREATE_ORDER = "ایجاد سفارش جدید"
CHOICE_GET_ORDERS = "لیست سفارشات من"
CHOICE_COLLECT_COIN = "جمع آوری سکه"
CHOICE_BY_LIKE = "جمع آوری سکه بوسیله لایک"
CHOICE_BY_COMMENT = "جمع آوری سکه کامنت"
CHOICE_BY_FOLLOW = "جمع آوری سکه دنبال کردن"

PAGE_CREATED = """

نام کاربری 💬: {{ page.username }}
تعداد پست 🎰: {{ page.post_no }}
فالو کنندگان ⬅️: {{ page.followers }}
فالو شده ها ➡️:{{ page.following }}

"""
